; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	thermograph1 - mode
	thermograph7 - mode
	image3 - mode
	infrared4 - mode
	thermograph2 - mode
	spectrograph0 - mode
	spectrograph6 - mode
	image5 - mode
	Star3 - direction
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	Star6 - direction
	GroundStation0 - direction
	Star5 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image3)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared4)
	(supports instrument1 image3)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument2 thermograph7)
	(supports instrument2 thermograph2)
	(supports instrument2 image5)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star5)
	(supports instrument3 thermograph2)
	(supports instrument3 spectrograph0)
	(supports instrument3 image5)
	(calibration_target instrument3 Star2)
	(supports instrument4 infrared4)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument5 thermograph2)
	(supports instrument5 infrared4)
	(supports instrument5 spectrograph6)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star5)
	(supports instrument6 infrared4)
	(calibration_target instrument6 Star5)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 Star8)
	(have_image Planet7 thermograph1)
	(have_image Star8 thermograph1)
	(have_image Star8 image5)
	(have_image Phenomenon9 image5)
	(have_image Planet10 thermograph1)
	(have_image Phenomenon11 thermograph2)
	(have_image Phenomenon11 spectrograph6)
	(have_image Planet12 thermograph1)
))

)

; plan
1. (turn_to satellite2 groundstation0 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 groundstation0)
   goals met: 0 of 10
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 10
3. (calibrate satellite2 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 0 of 10
4. (turn_to satellite2 phenomenon11 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon11)
   goals met: 0 of 10
5. (turn_to satellite1 star2 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star2)
   goals met: 0 of 10
6. (turn_to satellite0 star3 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star3)
   goals met: 0 of 10
7. (take_image satellite2 phenomenon11 instrument5 spectrograph6)
   added: (have_image phenomenon11 spectrograph6)
   goals met: 1 of 10
8. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 10
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 10
10. (calibrate satellite1 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 1 of 10
11. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 1 of 10
12. (take_image satellite2 phenomenon11 instrument5 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 2 of 10
13. (turn_to satellite0 planet10 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet10)
   goals met: 2 of 10
14. (take_image satellite0 planet10 instrument0 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 3 of 10
15. (turn_to satellite0 planet12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet12)
   goals met: 3 of 10
16. (take_image satellite0 planet12 instrument0 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 4 of 10
17. (turn_to satellite0 planet7 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet7)
   goals met: 4 of 10
18. (take_image satellite0 planet7 instrument0 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 5 of 10
19. (turn_to satellite0 star8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star8)
   goals met: 5 of 10
20. (take_image satellite0 star8 instrument0 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 6 of 10
21. (turn_to satellite0 star2 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star2)
   goals met: 7 of 10
22. (turn_to satellite1 phenomenon9 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon9)
   goals met: 7 of 10
23. (take_image satellite1 phenomenon9 instrument2 image5)
   added: (have_image phenomenon9 image5)
   goals met: 8 of 10
24. (turn_to satellite1 star8 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star8)
   goals met: 9 of 10
25. (take_image satellite1 star8 instrument2 image5)
   added: (have_image star8 image5)
   goals met: 10 of 10
